{
    "head": {
        "title": "Житомирський обласний туристичний інформаційний центр",
        "desc": "Житомирський обласний туристичний інформаційний центр створений для сприяння та реалізації туристичного потенціалу Житомирщини. Тут Вам безкоштовно нададуть інформацію про туристичну інфраструктуру, архітектурну та культурну спадщину, екскурсії та можливості гарного дозвілля в Поліському краї.",
        "appTitle": "ЖОТІЦ"
    },
    "homePage": {
        "hero-link": "Детальніше",
        "events-title": "Актуальні події",
        "places-title": "Популярні місця",
        "news-title": "Новини",
        "events-link-label": "Переглянути всі події",
        "places-link-label": "Переглянути всі місця",
        "news-link-label": "Переглянути всі новини"
    },
    "header": {
        "title": "Мандруй Житомирщиною",
        "enter": "Увійти",
        "navigation": {
            "about": "Про Житомирщину",
            "news": "Новини",
            "events": "Афіша",
            "places": "Місця",
            "routes": "Маршрути",
            "guides": "Гіди"
        },
        "user-menu": {
            "settings": "Налаштування",
            "dashboard": "Панель керування",
            "sign-out": "Вийти"
        }
    },
    "auth": {
        "name": "Ім'я",
        "namePlaceholder": "Ваше ім'я",
        "email": "Email",
        "emailPlaceholder": "user@mail.com",
        "password": "Пароль",
        "passPlaceholder": "Your name",
        "repeatPassword": "Повторіть пароль",
        "sign-in": "Увійти",
        "sign-up": "Реєстрація"
    },
    "footer": {
        "address": "м.Житомир, вул. Мала Бердичівська 25, оф. 51",
        "copyright": "© 2024 офіційний веб-сайт Житомирського обласного туристичного інформаційного центру Житомирської обласної ради"
    },
    "navigetion": {
        "about": "Про Житомирщину",
        "news": "Новини",
        "events": "Афіша",
        "places": "Місця",
        "routes": "Маршрути",
        "guides": "Гіди"
    },
    "not-found": {
        "title": "Not Found",
        "message": "Could not find requested resource",
        "button": "Return to the main page"
    },
    "dashboard": {
        "menu": {
            "dashboard": "Панель керування",
            "addLocation": "Додати місце",
            "addEvent": "Додати подію",
            "addNews": "Додати новину"
        },
        "addLocation": {
            "addImage": "Натисніть для додавання або перетягніть сюди файл",
            "nameUk": "Назва українською",
            "nameEn": "Назва англійською",
            "descUk": "Опис українською",
            "descEn": "Опис англійською",
            "addressUk": "Адреса українською",
            "addressEn": "Адреса англійською",
            "phone": "Телефон",
            "email": "Email",
            "url": "Сайт",
            "facebook": "Facebook",
            "instagram": "Instagram",
            "gmapsUrl": "Посилання google maps",
            "latitude": "Широта",
            "longitude": "Довгота",
            "districtId": "Район",
            "communityId": "Громада",
            "categoryId": "Категорія",
            "submit": "Додати місце"
        },
        "addEvent": {
            "addImage": "Натисніть для додавання або перетягніть сюди файл",
            "nameUk": "Назва українською",
            "nameEn": "Назва англійською",
            "descUk": "Опис українською",
            "descEn": "Опис англійською",
            "addressUk": "Адреса українською",
            "addressEn": "Адреса англійською",
            "phone": "Телефон",
            "email": "Email",
            "url": "Сайт",
            "categoryId": "Категорія",
            "submit": "Додати подію",
            "start": "Початок події",
            "duration": "Тривалість події",
            "tags": "Теги",
            "periodic": "Періодична подія",
            "districtId": "Район",
            "communityId": "Громада"
        },
        "addNews": {
            "addImage": "Натисніть для додавання або перетягніть сюди файл",
            "nameUk": "Назва українською",
            "nameEn": "Назва англійською",
            "descUk": "Опис українською",
            "descEn": "Опис англійською",
            "textUk": "Текст українською",
            "textEn": "Текст английською",
            "submit": "Додати статтю",
            "tags": "Теги"
        }
    },
    "pages": {
        "list-filter-panel": {
            "districts-placeholder": "Оберіть район",
            "communities-placeholder": "Оберіть громаду"
        },
        "places": {
            "places-page-metadata": {
                "title": "Цікаві місця Житомирщіни",
                "description": "Зібрання місць Житомирської області, які зацікавлять як туристів, що завітали в цей чарівний край, так і місцевих жителів, які прагнуть глибше дослідити рідну землю."
            },
            "select-category": "Оберіть категорії місць",
            "category-not-found": "Категорії не знайдено",
            "select-district": "Оберіть район",
            "select-community": "Оберіть громаду",
            "places-not-found": "Місця не знайдені",
            "filter-reset": "Скинути фільтри",
            "about": "Про місце",
            "similar": "Схожі місця"
        },
        "events": {
            "events-page-metadata": {
                "title": "Цікаві події Житомирської області",
                "description": "Перелік цікавих подій, що відбувалися чи будуть відбуватися у Житомирській області ."
            },
            "events-not-found": "Події не знайдено",
            "select-tag": "Оберіть мітки",
            "tag-not-found": "Мітки не знайдено",
            "duration": "{count} години",
            "about": "Про подію",
            "similar": "Схожі події"
        },
        "news": {
            "news-page-metadata": {
                "title": "Туристичні новини Житомирської області",
                "description": "Новини Житомирської області у сфері туризму."
            },
            "news-not-found": "Новини не знайдено",
            "select-tag": "Оберіть мітки",
            "tag-not-found": "Мітки не знайдено",
            "similar": "Схожі новини"
        },
        "about": {
            "metadata": {
                "title": "Цікаві факти про житомирську область",
                "description": "На сторінці зібрані цікаві факти про житомирську область"
            },
            "title": "Житомирщіна туристична",
            "knowing": {
                "title": "Варто знати",
                "text": "Житомирщина – область на півночі України, в межах Поліської низовини, на півдні в межах Придніпровської височини. На півночі межує з Гомельською областю Білорусі, на сході з Київською, на півдні з Вінницькою, на заході з Хмельницькою та Рівненською областями України. Адміністративним центром є м. Житомир.Житомирщина входить у п'ятірку найбільших за площею областей України. Площа області становить 29,9 тис. км2, що складає 4,9% території України. За своїми розмірами поступається лише Одеській, Дніпровській, Чернігівській та Харківській областям. В той же час, Житомирщина більша ніж такі країни як Вірменія, Албанія, Ізраїль, Кіпр або Ліван.Протяжність області із заходу на схід сягає 170 кілометрів, а відстань з півночі на південь складає 230 кілометрів. Складається з 23 районів. Має 5 міст обласного значення (Бердичів, Житомир, Коростень, Малин, Новоград-Волинський), 7 міст районного значення (Андрушівка, Баранівка, Коростишів, Овруч, Олевськ, Радомишль, Чуднів), 43 селища міського типу; 1619 сільських населених пунктів.Завдяки вигідному географічному положенню і розгалуженій мережі автомобільних шляхів та залізниць область має зручне транспортне сполучення з Києвом, Львовом, Ужгородом, Харковом, Одесою, Мінськом, Москвою, Санкт-Петербургом, а також країнами Східної і Центральної Європи.Житомирщина має потужний ресурсний потенціал для розвитку туризму, починаючи від природних об’єктів, аналогів яким немає в Україні та світі (Геологічний заказник «Камінне село», більш як 500-літні дуби «Урочища «Тригір’я», унікальні сосни «Урочища «Модрина», реліктова Азалія Понтійська «Поліського природного заповідника»), закінчуючи сучасними промисловими підприємствами, які радо приймають відвідувачів та демонструють свої виробництва (ПАТ Житомирський маслозавод - компанія «Рудь», ТОВ «Органік Мілк», ПрАТ «Мар’янівський склозавод»)."
            },
            "history": {
                "title": "Історія",
                "text": "У V-VII ст. нової ери територія Житомирської області була заселена східнослов'янськими племенами: північ – древлянами, центральна частина і південь – полянами, які займались землеробством і скотарством. Древляни займались також мисливством, бджільництвом, виробництвом ювелірних прикрас, торгівлею. У ІХ ст. з'являються міста, що стають центрами ремесел і торгівлі: Вручий (Овруч), Іскорость (Коростень).У XI – на поч. ХІІ ст. сучасна територія Житомирської області входила до складу Київської Русі. Волинь і Полісся, за відомим істориком І. Крип'якевичем, належали до слов'янської прабатьківщини, були колискою українського народу.Житомирщина входить у п'ятірку найбільших за площею областей України. Площа області становить 29,9 тис. км2, що складає 4,9% території України. За своїми розмірами поступається лише Одеській, Дніпровській, Чернігівській та Харківській областям. В той же час, Житомирщина більша ніж такі країни як Вірменія, Албанія, Ізраїль, Кіпр або Ліван.За результатом трьох поділів Польщі (1772, 1793, 1795) Волинь разом з Київщиною і Поділлям увійшли до складу Російської імперії. Територія краю увійшла до складу Волинської і частково до Київської губерній, утворених царським указом 1797 р. Центром Волинської губернії від 1804 р. став Житомир."
            },
            "born": {
                "title": "На Житомирщині народилися",
                "Conrad": {
                    "name": "Джозеф Конрад (Юзеф Теодор Конрад Коженьовський) (Бердичів, 1857-1924)",
                    "text": "англійський письменник польського походження, класик англійської літератури."
                },
                "Korolenko": {
                    "name": "Володимир Короленко (Житомир, 1853-1921)",
                    "text": "видатний російський письменник українського походження. "
                },
                "Korolev": {
                    "name": "Сергій Корольов (Житомир, 1906-1966)",
                    "text": "радянський вчений українського походження, конструктор. Під його керівництвом запущено першу міжконтинентальну балістичну ракету, перший штучний супутник Землі, перший політ людини в космос та вихід людини в космос."
                },
                "Ukrainka": {
                    "name": "Леся Українка (Лариса Косач-Квітка) (Новоград-Волинський, 1871-1913)",
                    "text": "видатна українська поетеса."
                },
                "Lyatoshynsky": {
                    "name": "Борис Лятошинський (Житомир, 1895-1968)",
                    "text": "український композитор, вважається одним з основоположників модерного напрямку в українській музиці."
                },
                "Nestayko": {
                    "name": "Всеволод Нестайко (Бердичів, 1930-2014)",
                    "text": "український письменник, класик дитячої літератури, автор улюбленої дитячої книжки «Тореадори з Васюківки» та багатьох інших."
                },
                "Perelman": {
                    "name": "Натан Перельман (Житомир, 1906-2002)",
                    "text": "видатний радянський піаніст."
                },
                "Richter": {
                    "name": "Святослав Ріхтер (Житомир, 1915-1997)",
                    "text": "видатний радянський піаніст."
                },
                "Ohienko": {
                    "name": "Іван Огієнко (Іларіон) (Брусилів, 1882-1972)",
                    "text": "український вчений, політичний і церковний діяч."
                }
            },

            "transport": {
                "title": "Транспортне сполучення",
                "auto": {
                    "title": "Автотранспортна інфраструктура",
                    "text": "Автотранспортна інфраструктура Житомирської області, розташованої на перетині давніх торгових шляхів, являє собою доволі щільну мережу автомобільних доріг. Через автошляхи регіону забезпечується доступ подорожуючих до туристичних пам’яток і об’єктів краю. Більшість найвідвідуваніших туристичних об’єктів області розташовані поблизу магістральних автомобільних доріг. Через територію Житомирської області проходять три міжнародні автошляхи.",
                    "m06": {
                        "name": "Автошлях М 06",
                        "text": "Довжина 863,8 км, з’єднує Київ та Чоп (державний кордон з Угорщиною). Проходить через Київську, Житомирську, Рівненську, Закарпатську області. В межах Житомирської області перетинає наступні райони: Брусилівський, Радомишльський, Коростишівський, Житомирський, Пулинський, Новоград-Волинський. Протяжність дороги в межах області складає 190,0 км."
                    },
                    "m07": {
                        "name": "Автошлях М07 («Варшавка»)",
                        "text": "Довжина 487 км, Київ – Ковель – контрольно-пропускний пункт «Ягодин» (державний кодон з Польщею; напрямок на м. Люблін). В межах Житомирської області траса перетинає Малинський, Коростенський, Лугинський та Олевський райони. Протяжність у межах області становить 166,3 км."
                    },
                    "m21": {
                        "name": "Автошлях М21",
                        "text": "Довжина 384,2 км. Від контрольно-пропускного пункту Виступовичі (Білорусь) з’єднує Житомир з Могилів-Подільським (контрольно-пропускний пункт з Молдовою). Проходить територією Житомирської та Вінницької областей. Починаючи на контрольно-пропускному пункті Виступовичі, проходить через Овруч, Коростень, Черняхів, Житомир, Бердичів, Калинівку, Вінницю, Жмеринку та закінчується на пропускному пункті Могилів-Подільський, що веде до Бельців у Молдові. Загальна протяжність становить 243,9 км."
                    }
                },
                "railway": {
                    "title": "Залізнична транспортна інфраструктура",
                    "text": "Залізнична транспортна інфраструктура області включає 67 залізничних станцій, які здійснюють вантажні та пасажирські перевезення. Управління процесом перевезень здійснює ПАТ «Укрзалізниця», а саме Південно-Західна регіональна залізниця. Експлуатаційна довжина залізниці загального користування по території області складає 1017 км. Щільність залізничної мережі – 34 км / тис. кв. км. У області є 6 вузлових залізничних станцій: Коростень, Житомир, Бердичів, Новоград-Волинський-1, Овруч, Білокоровичі. Від станцій Житомир та Коростень в п'яти напрямках розходяться залізничні колії.Територією області проходять двоколійні електрифіковані залізничні лінії з інтенсивним рухом, а саме, Київ – Коростень – Новоград-Волинський – Шепетівка – Здолбунів – Львів. Ділянка Здолбунів – Козятин – Фастів – Київ працює на межі пропускної спроможності. Працює електрифікована залізнична лінія на ділянці Коростень – Київ (3 години триває подорож).Одноколійні залізничні лінії Коростень – Овруч – Калінковичі, Коростень – Олевськ – Сарни, Коростень – Новоград-Волинський - Шепетівка, Коростень – Житомир – Бердичів, Новоград-Волинський - Житомир – Фастів, Житомир – Коростишів, Білокоровичі – Овруч – Вільча забезпечують, головним чином, транспортні зв’язки області з прилеглими областями. Одноколійна залізнична лінія Коростень – Овруч – Калінковичі є напрямком, що проходять через українсько-білоруський кордон.Таким чином, залізничне сполучення сприяє формуванню туристичних потоків з міст Київ (Київська область) та Львів (Львівська область). Найбільш вигідне залізничне сполучення мають Коростень як найбільший залізничний вузол, Бердичів, Коростень та Житомир."
                }
            },
            "embassies": {
                "title": "Представництва іноземних держав",
                "address": "Адреса",
                "phone": "Телефон",
                "text": {
                    "georgia": {
                        "name": "Генеральне консульство Грузії",
                        "address": "вул. Пушкінська, 31",
                        "phone": "+380 (412) 220 633"
                    },
                    "lithuania": {
                        "name": "Почесне Консульство Литви",
                        "address": "пл. Перемоги, 10, БЦ",
                        "phone": "+380 (50) 463-72-26, +380 (542) 48-71-01"
                    },
                    "poland": {
                        "name": "Польский дім",
                        "address": "вул. Чуднівська, 34б",
                        "phone": "+380 (412) 24-34-22"
                    }
                }
            }
        }
    }
}
